alpine-baselayout
alpine-keys
apk-tools
scanelf
libc-utils
musl
busybox
libcrypto1.1
libssl1.1
ca-certificates-bundle
libretls
ssl_client
zlib
musl-utils
libintl
libgcc
sudo
ncurses-libs
zsh
apk-tools-zsh-completion
ca-certificates
brotli-libs
nghttp2-libs
libcurl
expat
pcre2
git
ncurses-terminfo-base
git-zsh-completion
readline
bash
libevent
tmux
tmux-zsh-completion
openssh-keygen
libedit
openssh-client-common
openssh-client-default
openssh-sftp-server
openssh-server-common
openssh-server
openssh
libacl
libattr
skalibs
s6-ipcserver
utmps
coreutils
tree
libgpg-error
libassuan
libcap
libffi
libblkid
libmount
pcre
glib
libgcrypt
libsecret
pinentry
libbz2
gmp
nettle
p11-kit
libtasn1
libunistring
gnutls
libksba
gdbm
libsasl
libldap
npth
sqlite-libs
gnupg
pass
pass-zsh-completion
xz-libs
libstdc++
mpdecimal
python3
py3-appdirs
py3-chardet
py3-idna
py3-urllib3
py3-certifi
py3-requests
py3-msgpack
py3-lockfile
py3-cachecontrol
py3-colorama
py3-contextlib2
py3-distlib
py3-distro
py3-six
py3-webencodings
py3-html5lib
py3-parsing
py3-packaging
py3-toml
py3-pep517
py3-progress
py3-retrying
py3-ordered-set
py3-setuptools
py3-pip
py3-pip-zsh-completion
ranger
perl
perl-error
perl-git
git-perl
stow
fzf
fzf-zsh-completion
neofetch
htop
http-parser
libssh2
libgit2
starship
fd
fd-zsh-completion
curl
binutils
libmagic
file
libgomp
libatomic
libgphobos
isl22
mpfr4
mpc1
gcc
musl-dev
libc-dev
g++
make
fortify-headers
patch
build-base
rust-stdlib
libxml2
llvm11-libs
rust
cargo
gcc-zsh-completion
cargo-zsh-completion
luajit
libuv
libluv
msgpack-c
unibilium
libtermkey
libvterm
neovim
fzf-neovim
less
bat
zoxide
