tap "buo/cask-upgrade"
tap "common-fate/granted"
tap "dracula/install"
tap "homebrew/bundle"
tap "homebrew/services"
tap "int128/kubelogin"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "r-lib/rig"
tap "teamookla/speedtest"
tap "zegervdv/zathura"
brew "openssl@3"
brew "sqlite"
brew "xz"
brew "zstd"
brew "libtiff"
brew "harfbuzz"
brew "librsvg"
brew "adwaita-icon-theme"
brew "highway"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "berkeley-db"
brew "black", restart_service: true
brew "blueutil"
brew "btop"
brew "bzip2"
brew "cargo-bundle"
brew "coreutils"
brew "tree-sitter"
brew "emacs"
brew "cask"
brew "clang-format"
brew "cmake"
brew "code-minimap"
brew "curl"
brew "dav1d"
brew "libxft"
brew "dmenu"
brew "docker"
brew "duf"
brew "duti"
brew "extract_url"
brew "libgit2"
brew "eza"
brew "fairymax"
brew "fd"
brew "imlib2"
brew "libxt"
brew "feh"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "mbedtls"
brew "librist"
brew "mpg123"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "svt-av1"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "isl"
brew "mpfr"
brew "gcc"
brew "gd"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glow"
brew "libgpg-error"
brew "libgcrypt"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "go"
brew "grep"
brew "gron"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "helm"
brew "hub"
brew "hunspell"
brew "libheif"
brew "imagemagick"
brew "ipython"
brew "isync"
brew "jq"
brew "jruby"
brew "k9s"
brew "khard"
brew "kubernetes-cli"
brew "lazygit"
brew "libimagequant"
brew "libnotify"
brew "pkg-config"
brew "libraqm"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "lynx"
brew "markdown"
brew "mas"
brew "ninja"
brew "meson"
brew "mono"
brew "mujs"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "mysql"
brew "ncdu"
brew "neofetch"
brew "notmuch"
brew "neomutt"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "no-more-secrets"
brew "node"
brew "nss"
brew "openblas"
brew "openconnect"
brew "pandoc"
brew "tree"
brew "pass"
brew "pass-git-helper"
brew "perl"
brew "tcl-tk"
brew "pillow"
brew "poppler"
brew "prettier"
brew "pyenv"
brew "pygments", link: false
brew "pyright"
brew "qt"
brew "qt@5"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "signal-cli"
brew "sops"
brew "starship"
brew "stylua"
brew "texlive"
brew "tldr"
brew "tmux"
brew "tor"
brew "urlview"
brew "vdirsyncer"
brew "w3m"
brew "wget"
brew "xsv"
brew "yarn"
brew "youtube-dl"
brew "zoxide"
brew "zsh"
brew "int128/kubelogin/kubelogin"
brew "osx-cross/avr/avr-gcc@9"
brew "teamookla/speedtest/speedtest"
brew "zegervdv/zathura/girara", args: ["HEAD"], link: false
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "aerospace"
cask "alacritty"
cask "betterdiscord-installer"
cask "brave-browser"
cask "db-browser-for-sqlite"
cask "discord"
cask "firefox"
cask "font-sauce-code-pro-nerd-font"
cask "maccy"
cask "monitorcontrol"
cask "notunes"
cask "qutebrowser"
cask "qview"
cask "rig"
cask "rstudio"
cask "session-manager-plugin"
cask "skim"
cask "spyder"
cask "sublime-text"
cask "vlc"
cask "wezterm"
cask "xquartz"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "com.alice.mac.GetPlainText", id: 508368068
mas "Easy CSV Editor", id: 1171346381
