tap "anomalyco/tap"
tap "azure/kubelogin"
tap "buo/cask-upgrade"
tap "charmbracelet/tap"
tap "choplin/jira-cli-mcp"
tap "common-fate/granted"
tap "dracula/install"
tap "fforster/gitlab-mcp", "https://gitlab.com/fforster/homebrew-gitlab-mcp.git"
tap "fluxcd/tap"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/services"
tap "int128/kubelogin"
tap "jorgerojas26/lazysql"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "r-lib/rig"
tap "teamookla/speedtest"
tap "textualize/homebrew"
tap "zegervdv/zathura"
brew "xz"
brew "zstd"
brew "libtiff"
brew "harfbuzz"
brew "librsvg"
brew "adwaita-icon-theme"
brew "highway"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "ca-certificates"
brew "openssl@3"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "libgit2"
brew "bat"
brew "berkeley-db"
brew "black", restart_service: :changed
brew "blueutil"
brew "btop"
brew "bzip2"
brew "cargo-bundle"
brew "coreutils"
brew "tree-sitter"
brew "emacs"
brew "cask"
brew "dav1d"
brew "chafa"
brew "clang-format"
brew "cmake"
brew "code-minimap"
brew "codex-acp"
brew "crossplane"
brew "csvkit"
brew "curl"
brew "ddgr"
brew "direnv"
brew "libxft"
brew "dmenu"
brew "docker"
brew "duf"
brew "duti"
brew "extract_url"
brew "eza"
brew "fabric-ai"
brew "fairymax"
brew "fd"
brew "imlib2"
brew "libxt"
brew "feh"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "mbedtls"
brew "librist"
brew "mpg123"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "svt-av1"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "isl"
brew "mpfr"
brew "gcc"
brew "gd"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glab"
brew "glow"
brew "libgpg-error"
brew "libgcrypt"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "go"
brew "graphviz"
brew "grep"
brew "gron"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "helm"
brew "hub"
brew "hunspell"
brew "libheif"
brew "imagemagick"
brew "innoextract"
brew "ipython"
brew "isync"
brew "libimagequant"
brew "libraqm"
brew "pillow"
brew "jiratui"
brew "jmeter"
brew "jq"
brew "jruby"
brew "just"
brew "k9s"
brew "khard"
brew "kubernetes-cli"
brew "krew"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "libnotify"
brew "libpq", link: true
brew "pkgconf"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "lynx"
brew "markdown"
brew "mas"
brew "mcp-atlassian"
brew "ninja"
brew "meson"
brew "minikube"
brew "mono"
brew "mujs"
brew "mysql"
brew "nmap"
brew "ripgrep"
brew "w3m"
brew "nb"
brew "ncdu"
brew "neofetch"
brew "notmuch"
brew "neomutt"
brew "neovim"
brew "newsboat"
brew "no-more-secrets"
brew "simdjson"
brew "node"
brew "nss"
brew "nushell"
brew "openblas"
brew "openconnect"
brew "tree"
brew "pass"
brew "pass-git-helper"
brew "perl"
brew "pngpaste"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "prettier"
brew "pyenv"
brew "pygments"
brew "pyright"
brew "qt"
brew "qt@5"
brew "r"
brew "reattach-to-user-namespace"
brew "sd"
brew "selene"
brew "shellcheck"
brew "shfmt"
brew "signal-cli"
brew "sops"
brew "starship"
brew "stow"
brew "stylua"
brew "tcl-tk"
brew "texlive"
brew "tldr"
brew "tmux"
brew "tokei"
brew "ttyd"
brew "typos-cli"
brew "urlview"
brew "vapoursynth"
brew "vdirsyncer"
brew "wget"
brew "xsv"
brew "yamllint"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "anomalyco/tap/opencode"
brew "charmbracelet/tap/crush"
brew "fforster/gitlab-mcp/gitlab-mcp"
brew "fluxcd/tap/flux"
brew "int128/kubelogin/kubelogin"
brew "osx-cross/avr/avr-gcc@9"
brew "teamookla/speedtest/speedtest"
brew "zegervdv/zathura/girara", args: ["HEAD"]
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "alacritty"
cask "brave-browser"
cask "claude"
cask "codex"
cask "copilot-cli"
cask "db-browser-for-sqlite"
cask "discord"
cask "excalidrawz"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "monitorcontrol"
cask "notunes"
cask "qutebrowser"
cask "qview"
cask "rstudio"
cask "session-manager-plugin"
cask "skim"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Easy CSV Editor", id: 1171346381
mas "Get Plain Text", id: 508368068
mas "Pages", id: 409201541
vscode "alefragnani.project-manager"
vscode "d3vr.tag-search"
vscode "davidanson.vscode-markdownlint"
vscode "dionmunk.vscode-notes"
vscode "dracula-theme.theme-dracula"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "reditorsupport.r-syntax"
vscode "repreng.csv"
vscode "rlivings39.fzf-quick-open"
vscode "techer.open-in-browser"
vscode "tomoki1207.pdf"
go "github.com/bonnefoa/kubectl-fzf/v3/cmd/kubectl-fzf-completion"
go "github.com/ssllabs/ssllabs-scan"
go "github.com/VirusTotal/vt-cli/vt"
cargo "spotify-tui"
krew "konfig"
krew "oidc-login"
